
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/mountaincenter/aws-ecs-terraform/actions/runs/4272531179)



<pre><code>Apply complete! Resources: 12 added, 4 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0a6a8776c40f22184]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-07061d938fbfad8f5]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0599a3100d34e9f84]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0facaa142b50b98e4]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-097015049d8e138b6]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0e37aaa8c44d1d159]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0cb316425b8ecde06]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0e37aaa8c44d1d1591080289494]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vpc.aws_route_table.public[0] has changed
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0e37aaa8c44d1d159"
      ~ route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "igw-0cb316425b8ecde06"
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "aws-ecs-terraform-public"
        }
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.vpc.aws_eip.nat[0] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-0599a3100d34e9f84"
      ~ tags                 = {
          ~ "Name" = "aws-ecs-terraform-ap-northeast-1-1a" -> "aws-ecs-terraform-ap-northeast-1a"
        }
      ~ tags_all             = {
          ~ "Name" = "aws-ecs-terraform-ap-northeast-1-1a" -> "aws-ecs-terraform-ap-northeast-1a"
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[1] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-07061d938fbfad8f5"
      ~ tags                 = {
          ~ "Name" = "aws-ecs-terraform-ap-northeast-1-1c" -> "aws-ecs-terraform-ap-northeast-1c"
        }
      ~ tags_all             = {
          ~ "Name" = "aws-ecs-terraform-ap-northeast-1-1c" -> "aws-ecs-terraform-ap-northeast-1c"
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = "eipalloc-0599a3100d34e9f84"
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1a"
        }
      + tags_all             = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1a"
        }
    }

  # module.vpc.aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = "eipalloc-07061d938fbfad8f5"
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1c"
        }
      + tags_all             = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1c"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-0facaa142b50b98e4"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-097015049d8e138b6"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0facaa142b50b98e4"
      ~ tags             = {
          ~ "Name" = "aws-ecs-terraform-private-ap-northeast-1-1a" -> "aws-ecs-terraform-private-ap-northeast-1a"
        }
      ~ tags_all         = {
          ~ "Name" = "aws-ecs-terraform-private-ap-northeast-1-1a" -> "aws-ecs-terraform-private-ap-northeast-1a"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[1] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-097015049d8e138b6"
      ~ tags             = {
          ~ "Name" = "aws-ecs-terraform-private-ap-northeast-1-1c" -> "aws-ecs-terraform-private-ap-northeast-1c"
        }
      ~ tags_all         = {
          ~ "Name" = "aws-ecs-terraform-private-ap-northeast-1-1c" -> "aws-ecs-terraform-private-ap-northeast-1c"
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = "rtb-0facaa142b50b98e4"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = "rtb-097015049d8e138b6"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-0e37aaa8c44d1d159"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-0e37aaa8c44d1d159"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Private Subnet 1a"
        }
      + tags_all                                       = {
          + "Name" = "Private Subnet 1a"
        }
      + vpc_id                                         = "vpc-0a6a8776c40f22184"
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Private Subnet 1c"
        }
      + tags_all                                       = {
          + "Name" = "Private Subnet 1c"
        }
      + vpc_id                                         = "vpc-0a6a8776c40f22184"
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Public Subnet 1a"
        }
      + tags_all                                       = {
          + "Name" = "Public Subnet 1a"
        }
      + vpc_id                                         = "vpc-0a6a8776c40f22184"
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "Public Subnet 1c"
        }
      + tags_all                                       = {
          + "Name" = "Public Subnet 1c"
        }
      + vpc_id                                         = "vpc-0a6a8776c40f22184"
    }

Plan: 12 to add, 4 to change, 0 to destroy.
module.vpc.aws_subnet.public[1]: Creating...
module.vpc.aws_subnet.private[1]: Creating...
module.vpc.aws_subnet.public[0]: Creating...
module.vpc.aws_subnet.private[0]: Creating...
module.vpc.aws_route_table.private[0]: Modifying... [id=rtb-0facaa142b50b98e4]
module.vpc.aws_eip.nat[1]: Modifying... [id=eipalloc-07061d938fbfad8f5]
module.vpc.aws_eip.nat[0]: Modifying... [id=eipalloc-0599a3100d34e9f84]
module.vpc.aws_route_table.private[1]: Modifying... [id=rtb-097015049d8e138b6]
module.vpc.aws_eip.nat[1]: Modifications complete after 1s [id=eipalloc-07061d938fbfad8f5]
module.vpc.aws_route_table.private[0]: Modifications complete after 1s [id=rtb-0facaa142b50b98e4]
module.vpc.aws_eip.nat[0]: Modifications complete after 1s [id=eipalloc-0599a3100d34e9f84]
module.vpc.aws_route_table.private[1]: Modifications complete after 1s [id=rtb-097015049d8e138b6]
module.vpc.aws_subnet.private[0]: Creation complete after 1s [id=subnet-0254166277dd4819c]
module.vpc.aws_subnet.private[1]: Creation complete after 1s [id=subnet-0350544b592d84480]
module.vpc.aws_route_table_association.private[1]: Creating...
module.vpc.aws_route_table_association.private[0]: Creating...
module.vpc.aws_route_table_association.private[1]: Creation complete after 1s [id=rtbassoc-0d01f04584d814cc8]
module.vpc.aws_route_table_association.private[0]: Creation complete after 1s [id=rtbassoc-03bb2f42b223de276]
module.vpc.aws_subnet.public[1]: Still creating... [10s elapsed]
module.vpc.aws_subnet.public[0]: Still creating... [10s elapsed]
module.vpc.aws_subnet.public[0]: Creation complete after 12s [id=subnet-0734681a525ab1b17]
module.vpc.aws_subnet.public[1]: Creation complete after 12s [id=subnet-0f2b05abd9b061ed8]
module.vpc.aws_nat_gateway.this[0]: Creating...
module.vpc.aws_route_table_association.public[1]: Creating...
module.vpc.aws_nat_gateway.this[1]: Creating...
module.vpc.aws_route_table_association.public[0]: Creating...
module.vpc.aws_route_table_association.public[1]: Creation complete after 1s [id=rtbassoc-05ac2a1f94be7e1bc]
module.vpc.aws_route_table_association.public[0]: Creation complete after 1s [id=rtbassoc-0107e11bf07361527]
module.vpc.aws_nat_gateway.this[0]: Still creating... [10s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [10s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [20s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [20s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [30s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [30s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [40s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [40s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [50s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [50s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m0s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [1m0s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m10s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [1m10s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m20s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [1m20s elapsed]
module.vpc.aws_nat_gateway.this[1]: Creation complete after 1m26s [id=nat-057ffe008570f4c9c]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m30s elapsed]
module.vpc.aws_nat_gateway.this[0]: Creation complete after 1m36s [id=nat-0db307605c2a72abb]
module.vpc.aws_route.private_nat_gateway[0]: Creating...
module.vpc.aws_route.private_nat_gateway[1]: Creating...
module.vpc.aws_route.private_nat_gateway[0]: Creation complete after 1s [id=r-rtb-0facaa142b50b98e41080289494]
module.vpc.aws_route.private_nat_gateway[1]: Creation complete after 1s [id=r-rtb-097015049d8e138b61080289494]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 12 added, 4 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":4,"Program":"tfcmt","SHA1":"c3a8ead73b980b29d9e2a9bf880f619b31edbaa1","Vars":{},"WorkflowName":"Terraform"} -->